app/views/portfolios/show.html.erb

    this.coinImg_url = data.coin.img_url;
    this.value = parseFloat(data.coin.value) * this.quantity
---
SELECT  "coins".* FROM "coins" WHERE "coins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]