app/views/portfolios/show.html.erb

SELECT "coins".* FROM "coins"
---
        <label for="coin">Coin:</label>
        <%= f.collection_select :coin_id, Coin.all, :id, :name, {}, {:class=>"form-control"} %><br>

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = ? AND "portfolios"."id" = ? LIMIT ?  [["user_id", 1], ["id", 27], ["LIMIT", 1]]
---
<div id="back-button" data-id="<%=@portfolio.id%>">
  <% if @user.portfolios.map{|portfolio| portfolio.id}.include?(@portfolio.id - 1) %>

SELECT "positions".* FROM "positions" WHERE "positions"."portfolio_id" = ?  [["portfolio_id", 1]]
---
<script>
  $(function () {
     $('form#new_position').on('submit', function(event) {
       let values = $(this).serialize();
       let portfolioId = parseInt($("form#new_position").attr("data-id"));
      $.ajax({
        type: "post",
          url: '/portfolios/' + portfolioId + '/positions',
          data: values,
          success: function(data) {
            let position = new Position(data);
            let priceData = $("span#portfolioValue").html();
            let portfolio = new Portfolio({"value": priceData})
            console.log(portfolio)
            portfolio.updatePortfolioValue(position.value)
            position.renderTemplate();
          }
       });return false
     })
   })