app/views/users/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", 10102879608962720], ["LIMIT", 1]]
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = ?  [["user_id", 5]]
---
<script>
$(function () {
  $("#show-more").on("click", function() {
    $.getJSON("/users/<%=@user.id%>/portfolios", function(data) {
      for (let i = 0; i < data.length; i++) {
        let portfolio = new Portfolio(data[i])
        portfolio.userID = data[i].user.id
        portfolio.renderTemplate()
      }
    }); return false
  });
})