app/controllers/activities_controller.rb

  def index
    @activities = PublicActivity::Activity.order("created_at desc").paginate(:page => params[:page], :per_page => 20)
---
SELECT "activities".* FROM "activities" ORDER BY created_at desc