app/controllers/coins_controller.rb

SELECT  "coins".* FROM "coins" WHERE "coins"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def show
    @coin = Coin.find(params[:id])