app/controllers/portfolios_controller.rb

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = ? AND "portfolios"."id" = ? LIMIT ?  [["user_id", 1], ["id", 27], ["LIMIT", 1]]
---
  def show
    @user = User.find_by(id: params[:user_id])
    @portfolio = @user.portfolios.find_by(id: params[:id])