app/controllers/portfolios_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
INSERT INTO "portfolios" ("name", "user_id", "created_at", "updated_at", "public") VALUES (?, ?, ?, ?, ?)  [["name", "Low risk"], ["user_id", 7], ["created_at", "2018-08-10 03:06:34.447653"], ["updated_at", "2018-08-10 03:06:34.447653"], ["public", 0]]
SELECT  "portfolios".* FROM "portfolios" WHERE (2) LIMIT ?  [["LIMIT", 1]]
---
  def create
    @user = User.find_by(id: params[:user_id])
    @portfolio = @user.portfolios.build(portfolio_params)
    @portfolio.save
    if @portfolio.errors.any?

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "coins".* FROM "coins"
---
  def show
    @user = User.find_by(id: params[:user_id])
    @portfolio = Portfolio.find_by(id: params[:id])
    @position = Position.new
    @positions = @portfolio.positions
    @coins = Coin.all

SELECT  "users".* FROM "users" WHERE (12) LIMIT ?  [["LIMIT", 1]]
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = ? AND "portfolios"."id" = ? LIMIT ?  [["user_id", 7], ["id", 41], ["LIMIT", 1]]
---
  def destroy
    @user = User.find_by(id: params[:user_id])
    @user.portfolios.delete(Portfolio.find(params[:id]))