app/controllers/positions_controller.rb

  def create
    @portfolio = Portfolio.find_by(id: params[:portfolio_id])
    @position = Position.new(position_params)
    if @position.save
      @portfolio.positions << @position
      redirect_to user_portfolio_path(current_user, @portfolio)
    else
      flash[:error] = 'Please enter a positive number.'
      @coins = Coin.all
      @user = User.find_by(id: params[:user_id])
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
INSERT INTO "positions" ("user_id", "portfolio_id", "coin_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 7], ["portfolio_id", 41], ["coin_id", 1], ["quantity", 5], ["created_at", "2018-08-13 13:01:31.784347"], ["updated_at", "2018-08-13 13:01:31.784347"]]
SELECT "coins".* FROM "coins"
SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]