app/controllers/sessions_controller.rb

  def create
    @user = User.find_or_create_by(name: params[:user][:name])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "rasputin"], ["LIMIT", 1]]

    def create_from_facebook
      @called_omniauth = true
      @user = User.find_or_create_by(uid: auth['uid']) do |u|
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "uid") VALUES (?, ?, ?, ?, ?)  [["name", "Sebastian Gertz"], ["email", "sebgertz@gmail.com"], ["created_at", "2018-08-14 03:06:33.564331"], ["updated_at", "2018-08-14 03:06:33.564331"], ["uid", "10102879608962720"]]
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "10102879608962720"], ["LIMIT", 1]]