app/models/coin.rb

  def number_of_users
    count = 0
    User.all.each do |user|
      if user.positions.any?{|pos| pos.coin_id == self.id}
---
SELECT "users".* FROM "users"
SELECT "positions".* FROM "positions" INNER JOIN "portfolios" ON "positions"."portfolio_id" = "portfolios"."id" WHERE "portfolios"."user_id" = ?  [["user_id", 24]]

  def self.with_most_holders
    self.all.max_by {|coin| coin.number_of_users}
---
SELECT "coins".* FROM "coins"

  def self.most_widely_held
    self.all.sort{|a,b| b.positions.count <=> a.positions.count}[0]
---
SELECT COUNT(*) FROM "positions" WHERE "positions"."coin_id" = ?  [["coin_id", 2]]