app/models/portfolio.rb

SELECT "positions".* FROM "positions" WHERE "positions"."portfolio_id" = ?  [["portfolio_id", 4]]
---
  def value
    @sum = 0
    self.positions.each do |pos|