app/models/position.rb

SELECT  "coins".* FROM "coins" WHERE "coins"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def value
    self.coin.value * self.quantity